Revit 2027 API
BuiltInFailures.DividedSurfaceFailures.DividedSurfaceSplittingCurveChainsBetweenMultipleNeighbors Property
 Curve elements which form chains connecting points shared by more than two curve elements are ignored.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DividedSurfaceSplittingCurveChainsBetweenMultipleNeighbors { get; }
Public Shared ReadOnly Property DividedSurfaceSplittingCurveChainsBetweenMultipleNeighbors As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DividedSurfaceSplittingCurveChainsBetweenMultipleNeighbors {
	FailureDefinitionId^ get ();
}
static member DividedSurfaceSplittingCurveChainsBetweenMultipleNeighbors : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DividedSurfaceFailures Class
Autodesk.Revit.DB Namespace